{
    "papers": [
        {
            "id": "paper1",
            "title": "Tsunamis in Lingding Bay, China, caused by the 2022 Tonga volcanic eruption",
            "authors": ["Yuchen Wang", "Peitao Wang", "Hoiio Kong", "Chan-Seng Wong"],
            "year": 2023,
            "journal": "Geophysical Journal International",
            "volume": "232",
            "issue": "3",
            "pages": "2175-2185",
            "doi": "10.1093/gji/ggac291",
            "keywords": ["Tsunamis", "Time-series analysis", "Wavelet transform", "Atmospheric effects (volcano)"],
            "abstract": "The Hunga Tonga-Hunga Ha'apai volcano eruption resulted in propagation of tsunamis globally. Atmospheric pressure disturbances and tsunamis were recorded in Lingding Bay, China, situated more than 9000 km from the volcano. We studied the features of tsunamis in Lingding Bay and its surrounding areas by using records from tide gauges and meteorological stations. Lamb waves were observed in the bay approximately 8, 44 and 80 hr after the volcanic eruption. The first and second tsunami waves arrived approximately 11 and 45–47 hr following the eruption, respectively, indicating consistency with the arrival time of Lamb waves. In addition, wavelet and Fourier analyses were applied to the sea level records to investigate the frequency characteristics. The ratio of the tsunami spectra to the background spectra for two tsunami waves was calculated as the source spectra. The source spectra of two tsunami waves were mostly of the same shape, with dominant periods of ∼17 and ∼46 min. Our results provide information for theoretical investigation of the Tonga tsunami event. More efforts should be devoted to relevant research on the generating mechanism and early warning of tsunamis from non-seismic origins.",
            "citation": "Wang, Y., Wang, P., Kong, H., & Wong, C. S. (2023). Tsunamis in Lingding Bay, China, caused by the 2022 Tonga volcanic eruption. Geophysical Journal International, 232(3), 2175-2185.",
            "url": "https://doi.org/10.1093/gji/ggac291",
            "tags": ["Seismology", "Tsunami Research", "Volcanic Effects"],
            "publishedDate": "2022-07-31",
            "updatedDate": "2023-03-01"
        },
        {
            "id": "paper2",
            "title": "Neural Network-Based Identification of Cloud Types from Ground-Based Images of Cloud Layers",
            "authors": ["Z. Li", "H. Kong", "C.-S. Wong"],
            "year": 2023,
            "journal": "Applied Sciences",
            "volume": "13",
            "issue": "7",
            "pages": "4470",
            "doi": "10.3390/app13074470",
            "keywords": ["ground-based cloud images", "cloud genera", "identification", "convolutional neural networks", "texture", "Gamma Correction"],
            "abstract": "Clouds are a significant factor in regional climates and play a crucial role in regulating the Earth's water cycle through the interaction of sunlight and wind. Meteorological agencies around the world must regularly observe and record cloud data. Unfortunately, the current methods for collecting cloud data mainly rely on manual observation. This paper presents a novel approach to identifying ground-based cloud images to aid in the collection of cloud data. However, there is currently no publicly available dataset that is suitable for this research. To solve this, we built a dataset of surface-shot images of clouds called the SSC, which was overseen by the Macao Meteorological Society. Compared to previous datasets, the SSC dataset offers a more balanced distribution of data samples across various cloud genera and provides a more precise classification of cloud genera. This paper presents a method for identifying cloud genera based on cloud texture, using convolutional neural networks. To extract cloud texture effectively, we apply Gamma Correction to the images. The experiments were conducted on the SSC dataset. The results show that the proposed model performs well in identifying 10 cloud genera, achieving an accuracy rate of 80% for the top three possibilities.",
            "citation": "Li, Z., Kong, H., & Wong, C.-S. (2023). Neural Network-Based Identification of Cloud Types from Ground-Based Images of Cloud Layers. Applied Sciences, 13(7), 4470.",
            "url": "https://www.mdpi.com/2076-3417/13/7/4470",
            "tags": ["AI Applications", "Cloud Classification", "Image Processing"],
            "publishedDate": "2023-03-31",
            "updatedDate": "2023-03-31"
        },
        {
            "id": "paper3",
            "title": "Analysis of Aviation Risks Due to Adverse Weather Conditions. Case Study: Pucallpa Accident 08/23/2005",
            "authors": ["D. Vicente", "N. Moggiano", "Y. Wang", "C.-S. Wong"],
            "year": 2024,
            "journal": "Preprints",
            "volume": "",
            "issue": "",
            "pages": "2024051638",
            "doi": "10.20944/preprints202405.1638.v1",
            "keywords": ["Aviation", "risks", "meteorological information", "meteorological sensors", "meteorological variables", "meteorological reports"],
            "abstract": "Weather-related risks in aviation are one of the main causes of accidents worldwide. This article aims to analyze aviation risks resulting from adverse weather conditions, using the case study of the Pucallpa accident that occurred on August 23, 2005, in eastern Peru. In this analysis, we have determined the relationship between meteorological information and aviation risks, presented a matrix of risks associated with the most predominant meteorological variables at Pucallpa airport, and drawn up three maps of meteorological risks indicating the month of the year in which their incidence is most relevant. Finally, we conclude that it is essential to emphasize the importance of considering the prevailing weather conditions at Pucallpa airport to help mitigate the potential risks that may occur during different phases of the flight.",
            "citation": "Vicente, D., Moggiano, N., Wang, Y., & Wong, C.-S. (2024). Analysis of Aviation Risks Due to Adverse Weather Conditions. Case Study: Pucallpa Accident 08/23/2005. Preprints, 2024051638.",
            "url": "https://doi.org/10.20944/preprints202405.1638.v1",
            "tags": ["Aviation Safety", "Weather Risks", "Case Study"],
            "publishedDate": "2024-05-24",
            "updatedDate": "2024-05-24"
        },
        {
            "id": "paper4",
            "title": "A Novel Stacking Ensemble Learning Approach for Predicting PM2.5 Levels in Dense Urban Environments Using Meteorological Variables: A Case Study in Macau",
            "authors": ["H. Tian", "H. Kong", "C. Wong"],
            "year": 2024,
            "journal": "Applied Sciences",
            "volume": "14",
            "issue": "12",
            "pages": "5062",
            "doi": "10.3390/app14125062",
            "keywords": ["particulate matter", "meteorological factors", "correlation analysis", "ensemble learning", "PM2.5 prediction"],
            "abstract": "Air pollution, particularly particulate matter such as PM2.5 and PM10, has become a focal point of global concern due to its significant impact on air quality and human health. Macau, as one of the most densely populated cities in the world, faces severe air quality challenges. We leveraged daily pollution data from 2015 to 2023 and hourly meteorological pollution monitoring data from 2020 to 2022 in Macau to conduct an in-depth analysis of the temporal trends of and seasonal variations in PM2.5 and PM10, as well as their relationships with meteorological factors. The findings reveal that PM10 concentrations peak during dawn and early morning, whereas PM2.5 distributions are comparatively uniform. PM concentrations significantly increase in winter and decrease in summer, with relative humidity, temperature, and sea-level atmospheric pressure identified as key meteorological determinants. To enhance prediction accuracy, a Stacking-based ensemble learning model was developed, employing LSTM and XGBoost as base learners and LightGBM as the meta-learner for predicting PM2.5 concentrations. This model outperforms traditional methods such as LSTM, CNN, RF, and XGB across multiple performance metrics.",
            "citation": "Tian, H., Kong, H., & Wong, C. (2024). A Novel Stacking Ensemble Learning Approach for Predicting PM2.5 Levels in Dense Urban Environments Using Meteorological Variables: A Case Study in Macau. Applied Sciences, 14(12), 5062.",
            "url": "https://doi.org/10.3390/app14125062",
            "tags": ["Air Quality", "Machine Learning", "Urban Environment"],
            "publishedDate": "2024-06-10",
            "updatedDate": "2024-06-10"
        },
        {
            "id": "paper5",
            "title": "Extreme Rainfall Mechanisms Exhibited by Typhoon Morakot (2009)",
            "authors": ["C. Y. Huang", "C. S. Wong", "T. C. Yeh"],
            "year": 2011,
            "journal": "Terrestrial, Atmospheric & Oceanic Sciences",
            "volume": "22",
            "issue": "6",
            "pages": "",
            "doi": "",
            "keywords": ["Typhoon Morakot", "MM5 4DVAR", "BDA", "CMR"],
            "abstract": "Moderate Typhoon Morakot (2009) became the most catastrophic typhoon in Taiwan on record. The MM5 numerical experiments with and without bogus data assimilation (BDA) were used to investigate the extreme rainfall mechanisms in Taiwan associated with the westbound typhoon. The BDA, based on 4DVAR, helps MM5 to maintain a more consolidated typhoon vortex and better predict the observed track after landfall, thus producing realistic extreme rainfall (about 2400 mm) at the southern and Central Mountain Range (CMR) of Taiwan. Severe rainfall in Taiwan is dominated by the CMR that hence modulates rainfall predictability. Model analyses indicate that the synoptic environment provides low-level preconditioning with large convective available energy (CAPE) in the southwest monsoon conveying belt in conjunction with the cyclonic Morakot. When Morakot passed slowly over north Taiwan, the developing Tropical Storm Goni, originating west of Hong Kong, facilitated the moist southwesterly flow to converge with the northerly cyclonic flow of Morakot. These processes contributed to enhanced rainfall in south Taiwan. In an experiment whereby the Goni vortex was initially deactivated by BDA, the southwesterly prevailing flow, southwest of Taiwan, weakened considerably and shifted southward at a later time, resulting in one-third reduction in total accumulated rainfall in south Taiwan. Conversely, total accumulated rainfall in Taiwan is greatly reduced when the initial Morakot vortex is deactivated. Removal of Taiwan topography results in a significant reduction in total accumulated rainfall by more than 50%, due to lack of orographic lift by the CMR.",
            "citation": "Huang, C. Y., Wong, C. S., & Yeh, T. C. (2011). Extreme Rainfall Mechanisms Exhibited by Typhoon Morakot (2009). Terrestrial, Atmospheric & Oceanic Sciences, 22(6).",
            "url": "https://pdfs.semanticscholar.org/6637/c1b9334a899b87abd243f74d7e538d729fba.pdf",
            "tags": ["Typhoon Research", "Rainfall Analysis", "Weather Modeling"],
            "publishedDate": "2011-12-01",
            "updatedDate": "2011-12-01"
        }
    ],
    "categories": [
        {
            "id": "ai",
            "name": "人工智慧",
            "icon": "ri-brain-line"
        },
        {
            "id": "education",
            "name": "教育科技",
            "icon": "ri-book-open-line"
        },
        {
            "id": "computer-science",
            "name": "計算機科學",
            "icon": "ri-computer-line"
        }
    ],
    "settings": {
        "defaultSort": "year-desc",
        "citationFormat": "APA",
        "itemsPerPage": 10,
        "enableExport": true,
        "exportFormats": ["bibtex", "ris", "csv"]
    }
}